module.exports=`<pb n="660"/>
<p/><b>一、說一切有部的修行位次</b>
<svg src="M023.p660-1.svg">
修行位次 賢 五 停 心
三　賢（外凡） 七加行
別相念住 總相念住 煖
四善根（內凡）頂 忍
世第一法 聖
預　流 向
見道
有學 果
修道 一　來
向 果 不　還
向 果 阿羅漢 向 果
無學道 無學
</svg>

<p/><b>二、八忍八智（見道位十五心及修道位第十六心）</b>
<svg src="M023.p660-2.svg">
上下八諦
欲界
苦諦
苦法智忍－無間道－第 一 心
苦 法 智－解脫道－第 二 心
苦諦
苦類智忍－無間道－第 三 心
苦 類 智－解脫道－第 四 心
集諦
集法智忍－無間道－第 五 心
集 法 智－解脫道－第 六 心
集諦
集類智忍－無間道－第 七 心
集 類 智－解脫道－第 八 心
見道
上界
滅諦
滅法智忍－無間道－第 九 心
滅 法 智－解脫道－第 十 心
滅諦
滅類智忍－無間道－第十一心
滅 類 智－解脫道－第十二心
道諦
道法智忍－無間道－第十三心
道 法 智－解脫道－第十四心
道諦
道類智忍－無間道－第十五心
道 類 智－解脫道－第十六心
修道
</svg>
<p/><b>三、四諦十六行相</b>
<p/>（一）苦諦：無常、苦、空、無我。
<p/>（二）集諦：集、因、生、緣。
<p/>（三）滅諦：滅、靜、妙、離。
<p/>（四）道諦：道、如、行、出。
`;